Revit 2027 API
ComputationDataFor3DPathSet.SetTerminationPlaneNormal Method
 Sets the plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTerminationPlaneNormal(
	int end,
	XYZ terminationPlaneNormal
)
Public Sub SetTerminationPlaneNormal (
	end As Integer,
	terminationPlaneNormal As XYZ
)
public:
void SetTerminationPlaneNormal(
	int end,
	XYZ^ terminationPlaneNormal
)
member SetTerminationPlaneNormal :
        end : int *
        terminationPlaneNormal : XYZ -> unit
Parameters
end Int32
 The end of bar. Should be 0 for start or 1 for end.
terminationPlaneNormal XYZ
 The plane's normal in which the termination (e.g. hook, crank) at end of bar will stay. The normal should be perpendicular to the bar direction at the specified end of bar.
Exceptions
Exception | Condition
ArgumentException |  Normal terminationPlaneNormal for end end isn't a valid normal for bar.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  Invalid end. -or- terminationPlaneNormal has zero length.
See Also
Reference
ComputationDataFor3DPathSet Class
Autodesk.Revit.DB.Structure Namespace